src/Documents/ВыпускПродукции/ВыпускПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыпускПродукции</name>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Адресат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьPID</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РучныеИзмененияТребуемыхЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Реквизит</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокКабелей</name>
    <attributes>
      <name>PID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБрутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНетто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидСертификата</name>
      <type>
        <types>EnumRef.ВидыСертификатов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыгружатьВыделеннуюСтроку</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Гост</name>
      <type>
        <types>CatalogRef.Госты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДругоеНапряжение</name>
      <type>
        <types>CatalogRef.Напряжения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КодРосстандарта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСтрокой</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Марка</name>
      <type>
        <types>CatalogRef.МаркиКабелей</types>
      </type>
    </attributes>
    <attributes>
      <name>МаркаНапряжение</name>
      <type>
        <types>CatalogRef.Напряжения</types>
      </type>
    </attributes>
    <attributes>
      <name>НеДолжноБытьПробояПри</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерБарабана</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаявки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерИспытания</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Обшив</name>
      <type>
        <types>CatalogRef.Обшив</types>
      </type>
    </attributes>
    <attributes>
      <name>Отрезок</name>
      <type>
        <types>CatalogRef.Отрезки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакРучныеИзмененияТребуемыхЗначений</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РассчитываемоеКоличествоБухт</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатИспытанияЖилаЗаземления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатИспытанияЖилаКоричневая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатИспытанияЖилаОсновная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатИспытанияЖилаСиняя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатИспытанияЖилаЧерная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатИспытанияИзоляцииЖилаЗаземления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатИспытанияИзоляцииЖилаКоричневая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатИспытанияИзоляцииЖилаОсновная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатИспытанияИзоляцииЖилаСиняя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатИспытанияИзоляцииЖилаЧерная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РучноеРедактированиеКоличествоСтрокой</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РучноеРедактированиеРазмерКабеляИОтрезок</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тара</name>
      <type>
        <types>CatalogRef.Тара</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуемоеЗначениеЖилаЗаземления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуемоеЗначениеЖилаКоричневая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуемоеЗначениеЖилаОсновная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуемоеЗначениеЖилаСиняя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуемоеЗначениеЖилаЧерная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуемоеЗначениеИзоляцииЖилаЗаземления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуемоеЗначениеИзоляцииЖилаКоричневая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуемоеЗначениеИзоляцииЖилаОсновная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуемоеЗначениеИзоляцииЖилаСиняя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуемоеЗначениеИзоляцииЖилаЧерная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦветКабеля</name>
      <type>
        <types>CatalogRef.ЦветаКабеля</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтампОТК</name>
      <type>
        <types>CatalogRef.ШтампыОТК</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/CommonModules/ЗапросыПечатныхФорм/Module.bsl
#Область СлужебныеПроцедурыИФункции	
Функция  ПолучитьТекстЗапроса(ЭтоЗапросДляБирки) Экспорт
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВыпускПродукции.СписокКабелей.(
	|		Марка КАК Марка,
	|		ЦветКабеля КАК ЦветКабеля,
	|		НомерЗаявки КАК НомерЗаявки,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		НомерСтроки КАК НомерСтроки,
	|		Гост КАК Гост,
	|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		Артикул КАК Артикул,
	|		НомерИспытания КАК НомерИспытания,
	|		ШтампОТК КАК ШтампОТК,
	|		Тара КАК Тара,
	|		Марка.Напряжение КАК Напряжение,
	|		Обшив КАК Обшив,
	|		ВесБрутто КАК ВесБрутто,
	|		ВесНетто КАК ВесНетто,
	|		РассчитываемоеКоличествоБухт КАК РассчитываемоеКоличествоБухт,
	|		Размер КАК Размер,
	|		РучноеРедактированиеРазмерКабеляИОтрезок КАК РучноеРедактированиеРазмерКабеляИОтрезок,
	|		РучноеРедактированиеКоличествоСтрокой КАК РучноеРедактированиеКоличествоСтрокой,
	|		КоличествоСтрокой КАК КоличествоСтрокой,
	|		Отрезок КАК Отрезок,
	|		Марка.Напряжение КАК МаркаНапряжение,
	|		PID КАК PID,
	|		ПризнакРучныеИзмененияТребуемыхЗначений КАК ПризнакРучныеИзмененияТребуемыхЗначений,
	|		РезультатИспытанияЖилаОсновная КАК РезультатИспытанияЖилаОсновная,
	|		РезультатИспытанияЖилаКоричневая КАК РезультатИспытанияЖилаКоричневая,
	|		РезультатИспытанияЖилаЧерная КАК РезультатИспытанияЖилаЧерная,
	|		РезультатИспытанияЖилаСиняя КАК РезультатИспытанияЖилаСиняя,
	|		РезультатИспытанияЖилаЗаземления КАК РезультатИспытанияЖилаЗаземления,
	|		РезультатИспытанияИзоляцииЖилаОсновная КАК РезультатИспытанияИзоляцииЖилаОсновная,
	|		РезультатИспытанияИзоляцииЖилаКоричневая КАК РезультатИспытанияИзоляцииЖилаКоричневая,
	|		РезультатИспытанияИзоляцииЖилаЧерная КАК РезультатИспытанияИзоляцииЖилаЧерная,
	|		РезультатИспытанияИзоляцииЖилаСиняя КАК РезультатИспытанияИзоляцииЖилаСиняя,
	|		РезультатИспытанияИзоляцииЖилаЗаземления КАК РезультатИспытанияИзоляцииЖилаЗаземления,
	|		МаркаНапряжение КАК МаркаНапряжение1,
	|		ТребуемоеЗначениеЖилаОсновная КАК ТребуемоеЗначениеЖилаОсновная,
	|		ТребуемоеЗначениеЖилаКоричневая КАК ТребуемоеЗначениеЖилаКоричневая,
	|		ТребуемоеЗначениеЖилаЧерная КАК ТребуемоеЗначениеЖилаЧерная,
	|		ТребуемоеЗначениеЖилаСиняя КАК ТребуемоеЗначениеЖилаСиняя,
	|		ТребуемоеЗначениеЖилаЗаземления КАК ТребуемоеЗначениеЖилаЗаземления,
	|		ТребуемоеЗначениеИзоляцииЖилаОсновная КАК ТребуемоеЗначениеИзоляцииЖилаОсновная,
	|		ТребуемоеЗначениеИзоляцииЖилаКоричневая КАК ТребуемоеЗначениеИзоляцииЖилаКоричневая,
	|		ТребуемоеЗначениеИзоляцииЖилаЧерная КАК ТребуемоеЗначениеИзоляцииЖилаЧерная,
	|		ТребуемоеЗначениеИзоляцииЖилаСиняя КАК ТребуемоеЗначениеИзоляцииЖилаСиняя,
	|		ТребуемоеЗначениеИзоляцииЖилаЗаземления КАК ТребуемоеЗначениеИзоляцииЖилаЗаземления
	|	) КАК СписокКабелей,
	|	ВыпускПродукции.Номер КАК Номер,
	|	ВыпускПродукции.Дата КАК Дата,
	|	ВыпускПродукции.Адресат КАК Адресат,
	|	ВыпускПродукции.Ссылка КАК Ссылка,
	|	1 КАК СтрокаЗапросаБирок
	|ИЗ
	|	Документ.ВыпускПродукции КАК ВыпускПродукции
	|ГДЕ
	|	ВыпускПродукции.Ссылка В(&Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Марка,
	|	Размер";
	
	Если  ЭтоЗапросДляБирки тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "1 КАК СтрокаЗапросаБирок","ВЫБОР
		|КОГДА ВыпускПродукции.СписокКабелей.РучноеРедактированиеКоличествоСтрокой
		|	ТОГДА """"
		|КОГДА ВыпускПродукции.СписокКабелей.РучноеРедактированиеРазмерКабеляИОтрезок
		|	ТОГДА ВыпускПродукции.СписокКабелей.ВесНетто
		|ИНАЧЕ ВыпускПродукции.СписокКабелей.Вес
		|КОНЕЦ КАК ВесНетто");     //рефакторинг 01-05-2023
		
		КонецЕсли;                           
	    		
	Возврат ТекстЗапроса; 

КонецФункции

	
	
Функция  ПолучитьТаблицуТара(ИмяЭлемента,МассивОбъектов) Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ВыпускПродукцииСписокКабелей.Ссылка) КАК Количество,
	|	АВТОНОМЕРЗАПИСИ() КАК Номер,
	|	ВыпускПродукцииСписокКабелей.Тара.Наименование КАК ТараНаименование
	|ПОМЕСТИТЬ ВТТараОбшив
	|{ВЫБРАТЬ
	|	Количество.*}
	|ИЗ
	|	Документ.ВыпускПродукции.СписокКабелей КАК ВыпускПродукцииСписокКабелей
	|ГДЕ
	|	ВыпускПродукцииСписокКабелей.Ссылка В(&Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыпускПродукцииСписокКабелей.Тара.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТТараОбшив.Количество КАК Количество,
	|	ВТТараОбшив.ТараНаименование КАК Наименование
	|ИЗ
	|	ВТТараОбшив КАК ВТТараОбшив
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	  	
	Запрос.Параметры.Вставить("Ссылка", МассивОбъектов);
	Если ИмяЭлемента<>"Тара" тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Тара",ИмяЭлемента);
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Иначе
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
		
		
		Возврат РезультатЗапроса;
КонецФункции
#КонецОбласти
